bitcraze/crazyflie-firmware/lib/STM32_CPAL_Driver/devices/stm32f4xx/cpal_i2c_hal_stm32f4xx.h
#define CPAL_I2C1_DMA                   DMA1
#define CPAL_I2C1_DMA_CLK               RCC_AHB1Periph_DMA1 
#define CPAL_I2C1_DMA_CHANNEL           DMA_Channel_1  
   
#define CPAL_I2C1_IT_EVT_IRQn           I2C1_EV_IRQn  
#define CPAL_I2C1_IT_ERR_IRQn           I2C1_ER_IRQn   
    
/* TX Direction */
#ifdef CPAL_I2C1_DMA_TX_CONFIG1
 #define CPAL_I2C1_DMA_TX_Stream         DMA1_Stream6
 #define CPAL_I2C1_DMA_TX_IRQn           DMA1_Stream6_IRQn
 #define CPAL_I2C1_DMA_TX_IRQHandler     DMA1_Stream6_IRQHandler
 #define CPAL_I2C1_DMA_TX_TC_FLAG        DMA_FLAG_TCIF6
 #define CPAL_I2C1_DMA_TX_HT_FLAG        DMA_FLAG_HTIF6
 #define CPAL_I2C1_DMA_TX_TE_FLAG        DMA_FLAG_TEIF6
#elif defined (CPAL_I2C1_DMA_TX_CONFIG2)
 #define CPAL_I2C1_DMA_TX_Stream         DMA1_Stream7
 #define CPAL_I2C1_DMA_TX_IRQn           DMA1_Stream7_IRQn
 #define CPAL_I2C1_DMA_TX_IRQHandler     DMA1_Stream7_IRQHandler
 #define CPAL_I2C1_DMA_TX_TC_FLAG        DMA_FLAG_TCIF7
 #define CPAL_I2C1_DMA_TX_HT_FLAG        DMA_FLAG_HTIF7
 #define CPAL_I2C1_DMA_TX_TE_FLAG        DMA_FLAG_TEIF7
#endif
  
/* RX Direction */
#ifdef CPAL_I2C1_DMA_RX_CONFIG1
 #define CPAL_I2C1_DMA_RX_Stream         DMA1_Stream0
 #define CPAL_I2C1_DMA_RX_IRQn           DMA1_Stream0_IRQn
 #define CPAL_I2C1_DMA_RX_IRQHandler     DMA1_Stream0_IRQHandler
 #define CPAL_I2C1_DMA_RX_TC_FLAG        DMA_FLAG_TCIF0
 #define CPAL_I2C1_DMA_RX_HT_FLAG        DMA_FLAG_HTIF0
 #define CPAL_I2C1_DMA_RX_TE_FLAG        DMA_FLAG_TEIF0     
#elif defined (CPAL_I2C1_DMA_RX_CONFIG2)
 #define CPAL_I2C1_DMA_RX_Stream         DMA1_Stream5
 #define CPAL_I2C1_DMA_RX_IRQn           DMA1_Stream5_IRQn
 #define CPAL_I2C1_DMA_RX_IRQHandler     DMA1_Stream5_IRQHandler
 #define CPAL_I2C1_DMA_RX_TC_FLAG        DMA_FLAG_TCIF5
 #define CPAL_I2C1_DMA_RX_HT_FLAG        DMA_FLAG_HTIF5
 #define CPAL_I2C1_DMA_RX_TE_FLAG        DMA_FLAG_TEIF5     
#endif    
 
/*========= I2C2 specific defines (Clocks and DMA) =========*/   
  
#define CPAL_I2C2_CLK                   RCC_APB1Periph_I2C2
#define CPAL_I2C2_DR                    ((uint32_t)0x40005810)
#define CPAL_I2C2_AF                    GPIO_AF_I2C2  
  
#define CPAL_I2C2_DMA                   DMA1
#define CPAL_I2C2_DMA_CLK               RCC_AHB1Periph_DMA1 
#define CPAL_I2C2_DMA_CHANNEL           DMA_Channel_7  
  
#define CPAL_I2C2_IT_EVT_IRQn           I2C2_EV_IRQn  
#define CPAL_I2C2_IT_ERR_IRQn           I2C2_ER_IRQn   

/* TX Direction */
#define CPAL_I2C2_DMA_TX_Stream         DMA1_Stream7
#define CPAL_I2C2_DMA_TX_IRQn           DMA1_Stream7_IRQn
#define CPAL_I2C2_DMA_TX_IRQHandler     DMA1_Stream7_IRQHandler
#define CPAL_I2C2_DMA_TX_TC_FLAG        DMA_FLAG_TCIF7
#define CPAL_I2C2_DMA_TX_HT_FLAG        DMA_FLAG_HTIF7
#define CPAL_I2C2_DMA_TX_TE_FLAG        DMA_FLAG_TEIF7  
  
/* RX Direction */
#ifdef CPAL_I2C2_DMA_RX_CONFIG1
 #define CPAL_I2C2_DMA_RX_Stream         DMA1_Stream3
 #define CPAL_I2C2_DMA_RX_IRQn           DMA1_Stream3_IRQn
 #define CPAL_I2C2_DMA_RX_IRQHandler     DMA1_Stream3_IRQHandler
 #define CPAL_I2C2_DMA_RX_TC_FLAG        DMA_FLAG_TCIF3
 #define CPAL_I2C2_DMA_RX_HT_FLAG        DMA_FLAG_HTIF3
 #define CPAL_I2C2_DMA_RX_TE_FLAG        DMA_FLAG_TEIF3
#elif defined (CPAL_I2C2_DMA_RX_CONFIG2)
 #define CPAL_I2C2_DMA_RX_Stream         DMA1_Stream2
 #define CPAL_I2C2_DMA_RX_IRQn           DMA1_Stream2_IRQn
 #define CPAL_I2C2_DMA_RX_IRQHandler     DMA1_Stream2_IRQHandler
 #define CPAL_I2C2_DMA_RX_TC_FLAG        DMA_FLAG_TCIF2
 #define CPAL_I2C2_DMA_RX_HT_FLAG        DMA_FLAG_HTIF2
 #define CPAL_I2C2_DMA_RX_TE_FLAG        DMA_FLAG_TEIF2 
#endif
   
/*========= I2C3 specific defines (Clocks and DMA) =========*/   
  
#define CPAL_I2C3_CLK                   RCC_APB1Periph_I2C3
#define CPAL_I2C3_DR                    ((uint32_t)0x40005C10)
#define CPAL_I2C3_AF                    GPIO_AF_I2C3  
  
#define CPAL_I2C3_DMA                   DMA1
#define CPAL_I2C3_DMA_CLK               RCC_AHB1Periph_DMA1 
#define CPAL_I2C3_DMA_CHANNEL           DMA_Channel_3  
    
#define CPAL_I2C3_IT_EVT_IRQn           I2C3_EV_IRQn  
#define CPAL_I2C3_IT_ERR_IRQn           I2C3_ER_IRQn   

/* TX Direction */
#define CPAL_I2C3_DMA_TX_Stream         DMA1_Stream4
#define CPAL_I2C3_DMA_TX_IRQn           DMA1_Stream4_IRQn
#define CPAL_I2C3_DMA_TX_IRQHandler     DMA1_Stream4_IRQHandler
#define CPAL_I2C3_DMA_TX_TC_FLAG        DMA_FLAG_TCIF4
#define CPAL_I2C3_DMA_TX_HT_FLAG        DMA_FLAG_HTIF4
#define CPAL_I2C3_DMA_TX_TE_FLAG        DMA_FLAG_TEIF4  
  
/* RX Direction */
#define CPAL_I2C3_DMA_RX_Stream         DMA1_Stream2
#define CPAL_I2C3_DMA_RX_IRQn           DMA1_Stream2_IRQn
#define CPAL_I2C3_DMA_RX_IRQHandler     DMA1_Stream2_IRQHandler
#define CPAL_I2C3_DMA_RX_TC_FLAG        DMA_FLAG_TCIF2
#define CPAL_I2C3_DMA_RX_HT_FLAG        DMA_FLAG_HTIF2
#define CPAL_I2C3_DMA_RX_TE_FLAG        DMA_FLAG_TEIF2 
  
/* Exported macro ------------------------------------------------------------*/  

/*========= Peripheral Clock Command =========*/
  
#define __I2C_CLK_CMD(clk,cmd)                   RCC_APB1PeriphClockCmd((clk),(cmd))

#define __I2C_RCC_RESET(clk)                     RCC_APB1PeriphResetCmd((clk),ENABLE);\
                                                 RCC_APB1PeriphResetCmd((clk),DISABLE)  

  
#define __I2C_GPIO_CLK_CMD(clk,cmd)              RCC_AHB1PeriphClockCmd((clk),(cmd))
    
#define __DMA_CLK_CMD(clk,cmd)                   RCC_AHB1PeriphClockCmd((clk),(cmd))

#define __DMA_RESET_CMD(clk,cmd)                 RCC_AHB1PeriphResetCmd((clk),(cmd)) 
  
  
/*========= DMA =========*/
  
/* DMA channels enable/disable */  

#define __CPAL_I2C_HAL_ENABLE_DMATX(device)      CPAL_I2C_DMA_TX_Stream[(device)]->CR |= DMA_CR_EN  
  
#define __CPAL_I2C_HAL_DISABLE_DMATX(device)     CPAL_I2C_DMA_TX_Stream[(device)]->CR &= ~DMA_CR_EN 
  
#define __CPAL_I2C_HAL_ENABLE_DMARX(device)      CPAL_I2C_DMA_RX_Stream[(device)]->CR |= DMA_CR_EN  

#define __CPAL_I2C_HAL_DISABLE_DMARX(device)     CPAL_I2C_DMA_RX_Stream[(device)]->CR &= ~DMA_CR_EN

