bitcraze/crazyflie-firmware/lib/STM32_CPAL_Driver/devices/stm32f4xx/cpal_i2c_hal_stm32f4xx.h
/* DMA interrupts enable/disable */  

#define __I2C_HAL_ENABLE_DMATX_TCIT(device)      CPAL_I2C_DMA_TX_Stream[(device)]->CR |= DMA_IT_TC
  
#define __I2C_HAL_ENABLE_DMATX_HTIT(device)      CPAL_I2C_DMA_TX_Stream[(device)]->CR |= DMA_IT_HT
  
#define __I2C_HAL_ENABLE_DMATX_TEIT(device)      CPAL_I2C_DMA_TX_Stream[(device)]->CR |= DMA_IT_TE
  
#define __I2C_HAL_ENABLE_DMARX_TCIT(device)      CPAL_I2C_DMA_RX_Stream[(device)]->CR |= DMA_IT_TC
  
#define __I2C_HAL_ENABLE_DMARX_HTIT(device)      CPAL_I2C_DMA_RX_Stream[(device)]->CR |= DMA_IT_HT
  
#define __I2C_HAL_ENABLE_DMARX_TEIT(device)      CPAL_I2C_DMA_RX_Stream[(device)]->CR |= DMA_IT_TE
  
/* DMA interrupts flag management */

  
#define __CPAL_I2C_HAL_GET_DMATX_TCIT(device)    ((CPAL_I2C_DMA_TX_TC_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0) ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_TX_TC_FLAG [(device)]) :\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_TX_TC_FLAG [(device)])
  
#define __CPAL_I2C_HAL_GET_DMATX_HTIT(device)    ((CPAL_I2C_DMA_TX_HT_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0 ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_TX_HT_FLAG [(device)]):\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_TX_HT_FLAG [(device)]))

#define __CPAL_I2C_HAL_GET_DMATX_TEIT(device)    ((CPAL_I2C_DMA_TX_TE_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0 ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_TX_TE_FLAG [(device)]):\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_TX_TE_FLAG [(device)]))

#define __CPAL_I2C_HAL_GET_DMARX_TCIT(device)    ((CPAL_I2C_DMA_RX_TC_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0 ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_RX_TC_FLAG [(device)]):\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_RX_TC_FLAG [(device)]))  

#define __CPAL_I2C_HAL_GET_DMARX_HTIT(device)    ((CPAL_I2C_DMA_RX_HT_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0 ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_RX_HT_FLAG [(device)]):\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_RX_HT_FLAG [(device)]))

#define __CPAL_I2C_HAL_GET_DMARX_TEIT(device)    ((CPAL_I2C_DMA_RX_TE_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0 ? \
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->HISR & CPAL_I2C_DMA_RX_TE_FLAG [(device)]):\
                                                 (uint32_t)(CPAL_I2C_DMA[(device)]->LISR & CPAL_I2C_DMA_RX_TE_FLAG [(device)]))
  
#define __CPAL_I2C_HAL_CLEAR_DMATX_IT(device)    ((CPAL_I2C_DMA_TX_TC_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0) ? \
                                                 (CPAL_I2C_DMA[(device)]->HIFCR = (CPAL_I2C_DMA_TX_TC_FLAG[(device)] |\
                                                 CPAL_I2C_DMA_TX_HT_FLAG[(device)] | CPAL_I2C_DMA_TX_TE_FLAG[(device)])) :\
                                                 (CPAL_I2C_DMA[(device)]->LIFCR = (CPAL_I2C_DMA_TX_TC_FLAG[(device)]|\
                                                 CPAL_I2C_DMA_TX_HT_FLAG[(device)] | CPAL_I2C_DMA_TX_TE_FLAG[(device)]))
                                                   
#define __CPAL_I2C_HAL_CLEAR_DMARX_IT(device)    ((CPAL_I2C_DMA_RX_TC_FLAG[(device)] & DMA_HIGH_ISR_MASK) != 0) ? \
                                                 (CPAL_I2C_DMA[(device)]->HIFCR = (CPAL_I2C_DMA_RX_TC_FLAG[(device)] |\
                                                 CPAL_I2C_DMA_RX_HT_FLAG[(device)] | CPAL_I2C_DMA_RX_TE_FLAG[(device)])) :\
                                                 (CPAL_I2C_DMA[(device)]->LIFCR = (CPAL_I2C_DMA_RX_TC_FLAG[(device)]|\
                                                 CPAL_I2C_DMA_RX_HT_FLAG[(device)] | CPAL_I2C_DMA_RX_TE_FLAG[(device)]))
                                                   
/* Get DMA data counter */  

#define __CPAL_I2C_HAL_DMATX_GET_CNDT(device)    (uint32_t)(CPAL_I2C_DMA_TX_Stream[(device)]->NDTR)
 
#define __CPAL_I2C_HAL_DMARX_GET_CNDT(device)    (uint32_t)(CPAL_I2C_DMA_RX_Stream[(device)]->NDTR) 
 

/*========= I2C =========*/  
  
/* I2C enable/disable */  

#define __CPAL_I2C_HAL_ENABLE_DEV(device)        CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_PE  
  
#define __CPAL_I2C_HAL_DISABLE_DEV(device)       CPAL_I2C_DEVICE[(device)]->CR1 &= ~I2C_CR1_PE  
     
/* I2C software reset */

#define __CPAL_I2C_HAL_SWRST(device)             CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_SWRST; \
                                                 CPAL_I2C_DEVICE[(device)]->CR1 &= ~I2C_CR1_SWRST     
  
/* I2C interrupts enable/disable */  

#define __CPAL_I2C_HAL_ENABLE_ERRIT(device)      CPAL_I2C_DEVICE[(device)]->CR2 |= I2C_CR2_ITERREN   
   
#define __CPAL_I2C_HAL_DISABLE_ERRIT(device)     CPAL_I2C_DEVICE[(device)]->CR2 &= ~I2C_CR2_ITERREN   
  
#define __CPAL_I2C_HAL_ENABLE_EVTIT(device)      CPAL_I2C_DEVICE[(device)]->CR2 |= I2C_CR2_ITEVTEN   
   
#define __CPAL_I2C_HAL_DISABLE_EVTIT(device)     CPAL_I2C_DEVICE[(device)]->CR2 &= ~I2C_CR2_ITEVTEN 
  
#define __CPAL_I2C_HAL_ENABLE_BUFIT(device)      CPAL_I2C_DEVICE[(device)]->CR2 |= I2C_CR2_ITBUFEN   
   
#define __CPAL_I2C_HAL_DISABLE_BUFIT(device)     CPAL_I2C_DEVICE[(device)]->CR2 &= ~I2C_CR2_ITBUFEN 
  

/* I2C Addressing configuration */  

#define __CPAL_I2C_HAL_OAR2_CONF(device,value)   CPAL_I2C_DEVICE[(device)]->OAR2 &= ((uint16_t)0xFF01);\
                                                 CPAL_I2C_DEVICE[(device)]->OAR2 |= (uint16_t)((value) & 0x00FE)
 

#define __CPAL_I2C_HAL_ENABLE_GENCALL(device)    CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_ENGC   
       
#define __CPAL_I2C_HAL_ENABLE_DUALADDR(device)   CPAL_I2C_DEVICE[(device)]->OAR2 |= I2C_OAR2_ENDUAL  
  

/* I2C misc configuration */   

#define __CPAL_I2C_HAL_ENABLE_DMAREQ(device)     CPAL_I2C_DEVICE[(device)]->CR2 |= I2C_CR2_DMAEN  
  
#define __CPAL_I2C_HAL_DISABLE_DMAREQ(device)    CPAL_I2C_DEVICE[(device)]->CR2 &= ~I2C_CR2_DMAEN 
  
  
#define __CPAL_I2C_HAL_ENABLE_ACK(device)        CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_ACK  
  
#define __CPAL_I2C_HAL_DISABLE_ACK(device)       CPAL_I2C_DEVICE[(device)]->CR1 &= ~I2C_CR1_ACK  
  
 
